"""
Бабата на Деси всяка година приготвя обяд за семейството си за Великден. Напишете програма, която изчислява какви разходи ще има по приготвянето на обяда, като знаете колко броя козунаци, кори с яйца и килограма курабии е купила.  Цените на продуктите са следните:
    • Козунак  – 3.20 лв.
    • Яйца –  4.35 лв. за кора с 12 яйца
    • Курабии – 5.40 лв. за килограм
    • Боя за яйца - 0.15 лв. за яйце
"""

kozunak = int(input())
eggs = int(input())
korabii = int(input())

data = {'kozunak': 3.2, 'eggs': 4.35, 'korabii': 5.4, 'pain': 0.15, 'eggs_in_bag': 12}

total = kozunak * data['kozunak'] + eggs * data['eggs'] + \
        korabii * data['korabii'] + \
        ((eggs * data['eggs_in_bag']) * data['pain'])

print(f'{total:.2f}')
