"""
По време на Великденските празници, Деси иска да отиде на почивка. В таблицата са показани кои са дестинациите и каква е цената за нощувка спрямо датите, през които си е резервирала екскурзията.
"""

data = {'France': {'21-23': 30, '24-27': 35, '28-31': 40}, \
        'Italy': {'21-23': 28, '24-27': 32, '28-31': 39}, \
        'Germany': {'21-23': 32, '24-27': 37, '28-31': 43}}

destination = input()
dates = input()
nights = int(input())

price = nights * data[destination][dates]

print(f'Easter trip to {destination} : {price:.2f} leva.')